app/views/comments/_comment.erb

  <span class="dateandoptions">
    Posted <%=comment.created_at%> ago<br />
---
INSERT INTO `comments` (`comment`, `comment_type`, `created_at`, `email`, `is_backer`, `name`, `postDate`, `post_id`, `updated_at`, `userId`, `username`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)