app/views/users/dashboard.erb

                <tr>
                  <td>0 backers | <%= post.comments.size %> comments</td>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 50