app/views/posts/_displaypost.html.erb

        <% unless post.locations.nil? %>
          <% post.locations.each do | location| %>
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`post_id` = 36

         <%= post.description %></br></br></br>
         <% post.assets.each  do |asset_fields| %>
---
SELECT `assets`.* FROM `assets` WHERE `assets`.`post_id` = 36


         Posted By <%= User.find(post.user_id).firstname   %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 4]]

        Complaint Status:<%= post.status %>
        <% emailStat = EmailStat.find_by_postId(post.id) %>
---
SELECT `email_stats`.* FROM `email_stats` WHERE `email_stats`.`postId` = 112 LIMIT 1

      <% if !post.category.nil? -%>
        <%  Category.all.each do |category|  -%>
---
SELECT `categories`.* FROM `categories`