app/views/posts/_form.html.erb

SELECT `scenarios`.* FROM `scenarios`
---
                        <ul class="checkboxes clear">
				              <% Scenarios.all.each do |scenario| -%>

SELECT `compensations`.* FROM `compensations`
---
                        <ul class="checkboxes clear">
				            <% Compensation.all.each do |compensation| -%>

SELECT `categories`.* FROM `categories`
---
                            <div class="select-wrap">
								<%= location_form.select :category, options_from_collection_for_select(Category.all, "name", "name") ,{},{:class=>"select"}%>