app/views/posts/browse.html.erb

SELECT `categories`.* FROM `categories`
---
     <ul class="browse_categories">
     <% Category.all.each do |category| -%>