app/views/posts/show.html.erb

SELECT `locations`.* FROM `locations` WHERE `locations`.`post_id` = 117
---
        <% unless @post.locations.nil? %>
          <% @post.locations.each do | location| %>

SELECT `assets`.* FROM `assets` WHERE `assets`.`post_id` = 61
---
         <%= @post.description %></br></br></br>
         <% @post.assets.each  do |asset_fields| %>

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 4]]
---

         Posted By <%= User.find(@post.user_id).firstname   %>

SELECT `categories`.* FROM `categories`
---
      <% if !@post.category.nil? -%>
        <%  Category.all.each do |category|  -%>

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 52
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 52
---
<%= render "/shared/tweet_button" %>
<span id="comments_count"><%= pluralize(@post.comments.count, "Comment") %></span>