app/controllers/comments_controller.rb

  def create
        #throw error if not valid
      @post = Post.find(params[:post_id])
      if params[:comment][:comment].to_s.strip.length > 0
        unless @post.nil?
            @comment = @post.comments.build(params[:comment])
            if session[:user] != nil
              @comment.username = session[:user][:username]
              @comment.userId = session[:user][:id]
            end
        end
      end
    respond_to do |format|
      if @comment.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = ? LIMIT 1  [["id", "7"]]
SELECT COUNT(*) FROM `comments`
INSERT INTO `comments` (`comment`, `comment_type`, `created_at`, `email`, `is_backer`, `name`, `postDate`, `post_id`, `updated_at`, `userId`, `username`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)