app/controllers/company_emails_controller.rb

  def index
    @company_emails = CompanyEmail.all
---
SELECT `company_emails`.* FROM `company_emails`

  def show
    @company_email = CompanyEmail.find(params[:id])
---
SELECT `company_emails`.* FROM `company_emails` WHERE `company_emails`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    @company_email = CompanyEmail.new(params[:company_email])

    respond_to do |format|
      if @company_email.save
---
INSERT INTO `company_emails` (`created_at`, `email`, `name`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", Tue, 25 Sep 2012 07:51:19 UTC +00:00], ["email", "hrsht.rastogi13@gmail.com"], ["name", "harshit"], ["updated_at", Tue, 25 Sep 2012 07:51:19 UTC +00:00]]