app/controllers/email_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = ? LIMIT 1  [["id", 112]]
SELECT `locations`.* FROM `locations` WHERE `locations`.`post_id` = 112 LIMIT 1
SELECT `posts`.* FROM `posts`
UPDATE `locations` SET `email` = 'hrsht.rastogi@gmail.com', `updated_at` = '2012-11-08 08:59:58' WHERE `locations`.`id` = 44
SELECT `email_stats`.* FROM `email_stats` WHERE ((DATE(lastsent) < '2012-10-25' or lastsent IS NULL) and counter > 0)
SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 4]]
UPDATE `email_stats` SET `counter` = -1, `lastsent` = '2012-10-25 08:52:31', `updated_at` = '2012-10-25 08:52:31' WHERE `email_stats`.`id` = 4
---
  def sendmail
#    emailStatList = EmailStat.find(:all,:conditions=>["(DATE(lastsent) < ? or lastsent IS NULL) and counter > 0", 1.from_now.to_date - 1])
   @successEmailList =[]
    params[:arr].each do |p|
       map = p[1]
       postid=map[:postid]
         post = Post.find(postid)
       if map[:email].eql?(map[:oldemail])
         puts post.locations.first
         post.location.email=map[:email]
         post.location.save
       end
       if map[:email] != ''
         emailstat = EmailStat.where(:postId=>map[:postid]).first
         SupportEmailer.sendmail(post,post.location,User.find(post.user_id)).deliver
          emailstat[:counter] = emailstat.counter-1
          emailstat[:lastsent] = Time.now()
          emailstat.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 4]]
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = ? LIMIT 1  [["id", 119]]
---
  def configmail
   @postId=session[:postid]
   user = User.find(session[:user][:id])
   @count = user.email_count
   @postType= Post.find(@postId).posttype

INSERT INTO `email_stats` (`call`, `counter`, `created_at`, `lastsent`, `postId`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["call", nil], ["counter", nil], ["created_at", Wed, 17 Oct 2012 07:24:14 UTC +00:00], ["lastsent", nil], ["postId", nil], ["updated_at", Wed, 17 Oct 2012 07:24:14 UTC +00:00]]
---
  def saveconfig
      emailstat = EmailStat.new
      emailstat[:postId] = params[:postId]
      emailstat[:counter] = params[:counter]
      emailstat[:call] = params[:call]
      emailstat.save

SELECT `email_stats`.* FROM `email_stats` WHERE (DATE(lastsent) < '2012-10-27' and counter > 0)
---
  def viewmail
    @email_stats = EmailStat.where("counter > 0")