app/controllers/members_controller.rb

  def signin

    puts current_user.nil?
    puts "current user nil"
    puts session[:new_user]
    if !session['access_token'].nil?
      @graph = Koala::Facebook::API.new(session["access_token"])
      userinfo =  @graph.get_object("me")
      fb_id=userinfo['id']
      if fb_id
       userObj = User.find_all_by_fbid(fb_id.to_s)
---
SELECT `users`.* FROM `users` WHERE `users`.`fbid` = '659276550'

  def myprofile
    puts session
    puts session[:user].id
    if !session[:user].nil?
      @user= session[:user]
      puts @user.to_s
      openUmvox=@user.posts.where("status=?","Open")
      closeUmvox=@user.posts.where("status=?","Closed")
      @totalopen = openUmvox.size unless openUmvox.nil?
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 8 AND (status='Closed')
SELECT COUNT(*) FROM `posts` WHERE `posts`.`user_id` = 8 AND (status='Open')

  def updateprofile
     user = User.find(params[:user][:id])
     user.firstname=params[:user][:firstname]
     user.username = params[:user][:username]
     user.lastname = params[:user][:lastname]
     user.email = params[:user][:email]
     user.city = params[:user][:city]
     user.state = params[:user][:state]
     user.fbid = params[:user][:fbid]
     begin
      user.save!
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", "8"]]
UPDATE `users` SET `firstname` = 'qqq', `username` = 'myname', `lastname` = 'pee', `city` = 'qwqkj', `state` = 'jj', `fbid` = '', `updated_at` = '2012-11-21 08:22:09' WHERE `users`.`id` = 8