app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 4
---
 def index
   @meta_title = "List of All Voxes"
   @meta_description = " The voxes and cpmplaints of the user"
    if !params[:all].nil? and params[:all] == "true"
      @posts = Post.all
    else
      if !session['user'].nil?
         if session['user'].username == 'hrsht13'
            @posts=Post.all
         else
            @posts = Post.find_all_by_user_id(session["user"].id.to_s)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = ? LIMIT 1  [["id", "7"]]
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 7
---
  def show
    @post = Post.find_by_parameterize(params[:id])
#      Post.find(params[:id])
if @post.nil?
   @post=Post.find(params[:id])
end
    @meta_title = @post.question
   @meta_description = @post.description
    @backer = 0
    @backername=Array.new
     if @post.comments !=nil
       @post.comments.each do |comment|

SELECT `categories`.* FROM `categories`
---
  def new
    @meta_title = "Create a new Vox"
   @meta_description = "Express the concern, complaint or appreciate the service"
    @post = Post.new
    @post.scenario=[]
    @post.compensation=[]
    unless session[:user].nil?
      @post.user_id=session[:user].id
    end
    @post.detailinfo = Detailinfo.new
    unless params[:name].nil? and params[:addr].nil?
      loc = Location.new
      loc.address = params[:addr].nil? ? "" :params[:addr]
      loc.name = params[:name].nil? ? "" :params[:name]
      loc.zipcode = params[:zip].nil? ? "" : params[:zip]
      loc.city = params[:city].nil? ? "" : params[:city]
      @post.location=loc
      @haslocation=true
    else
      @haslocation=false
      @post.build_location
    end
    @category = Category.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 4]]
---
  def edit
    @post = Post.find_by_parameterize(params[:id])
    @isadmin=User.find(session[:user].id).admin

INSERT INTO `posts` (`address`, `category`, `company`, `compensation`, `created_at`, `description`, `posttype`, `question`, `scenario`, `status`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", "4"]]
---
  def create

    params[:post][:posttype] ='Complaint'
    @post = Post.new(params[:post])
    @post.parameterize = @post.question.parameterize

    respond_to do |format|

    if @post.save
    session[:postid]=@post.id
    Thread.new{SupportEmailer.createvox(@post,User.find(@post.user_id)).deliver}

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = ? LIMIT 1  [["id", "52"]]
UPDATE `posts` SET `description` = 'knknkn', `category` = 'Online Store', `scenario` = '---\n- \'2\'\n', `compensation` = '---\n- Compensation\n', `updated_at` = '2012-12-11 00:51:13' WHERE `posts`.`id` = 50
SELECT `assets`.* FROM `assets` WHERE `assets`.`post_id` = 50 AND `assets`.`id` IN (23)
---
  def update
    @post = Post.find(params[:id])
    respond_to do |format|
      if @post.update_attributes(params[:post])
        @post.assets.each do |asset|

SELECT `locations`.* FROM `locations` WHERE `locations`.`post_id` = 146
SELECT `categories`.* FROM `categories`
---
  def browse
    unless params[:type].nil?
      #:type is always location
      if params[:type] == 'category'
        locations = Location.find_all_by_category(params[:search])
      else
        @search = Location.search do
         fulltext params[:search]
        end
        locations = @search.results
      end
      @returnsearch =true
     end

    @locationGroupByName={}
    unless locations.nil?
     locations.each do |location|