app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`fbid` = '659276550'
---
  def signin

    puts current_user.nil?
    puts "current user nil"
    if !session['access_token'].nil?
      graph = Koala::Facebook::API.new(session["access_token"])
      userinfo =  graph.get_object("me")
      fb_id=userinfo['id']
      puts "fbId is " + fb_id.to_s
      if fb_id
       userObj = User.find_all_by_fbid(fb_id.to_s)

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 4 AND (status='Closed')
SELECT COUNT(*) FROM `posts` WHERE `posts`.`user_id` = 4 AND (status='Open')
---
  def myprofile
    if !session["user"].nil?
      @user= session['user']
      openUmvox=@user.posts.where("status=?","Open")
      closeUmvox=@user.posts.where("status=?","Closed")
      @totalopen = openUmvox.size unless openUmvox.nil?

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", "16"]]
UPDATE `users` SET `firstname` = 'kj', `username` = 'sdfs', `lastname` = 'jjjj', `city` = 'jj', `state` = 'j', `fbid` = '', `updated_at` = '2012-11-21 07:18:45' WHERE `users`.`id` = 19
---
  def updateprofile
     user = User.find(params[:user][:id])
     user.firstname=params[:user][:firstname]
     user.username = params[:user][:username]
     user.lastname = params[:user][:lastname]
     user.email = params[:user][:email]
     user.city = params[:user][:city]
     user.state = params[:user][:state]
     user.fbid = params[:user][:fbid]
     begin
      user.save!