app/views/members/_displaydashboardpost.html.erb

SELECT `locations`.* FROM `locations` WHERE `locations`.`post_id` = 119 LIMIT 1
---
<p><%=post.locations.first.category %> <b>

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 119
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 119
---
                      <% backer= 0 %>
                    <% if post.comments.size > 0 %>