app/views/members/dashboard.erb

					<ul>
					<% Category.all.each do |category| -%>
---
SELECT `categories`.* FROM `categories`